# Задание 1.
# Создайте класс Обувь. Необходимо хранить следующую информацию:
# ■ тип обуви; ✓ мужская, ✓ женская;
# ■ вид обуви (кроссовки, сапоги, сандалии, туфли и т.д.);
# ■ цвет;
# ■ цена;
# ■ производитель;
# ■ размер.
# Создайте необходимые методы для этого класса. Реализуйте паттерн MVC для класса Обувь
# и код для использования модели, контроллера и представления.
from controller import ShoeController


def main():
    app = ShoeController()
    app.run()


if __name__ == '__main__':
    main()